xs = [[1, 2, 3], [4, 5, 6], [7, 8, 9]]
ys = list(xs)  # Сделать мелкую копию

xs.append(['новый подсписок'])
# xs = [[1, 2, 3], [4, 5, 6], [7, 8, 9], ['новый подсписок']]
# ys = [[1, 2, 3], [4, 5, 6], [7, 8, 9]]

xs[1][0] = 'X'
# xs = [[1, 2, 3], ['X', 5, 6], [7, 8, 9], ['новый подсписок']]
# ys = [[1, 2, 3], ['X', 5, 6], [7, 8, 9]]

import copy
xs = [[1, 2, 3], [4, 5, 6], [7, 8, 9]]
zs = copy.deepcopy(xs)

xs[1][0] = 'X'
# xs = [[1, 2, 3], ['X', 5, 6], [7, 8, 9]]
# zs = [[1, 2, 3], [4, 5, 6], [7, 8, 9]]
